---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimError
source: html/80be01c2-73e0-c7d1-6265-46fb900c90cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeBadDimError Property

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions or be constrained due to connected fitting(s). You may try to disconnect the connections on the fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimError { get; }
```